In [1]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
from joblib import dump,load 
from sklearn import metrics
import warnings 
import numpy as np

pd.options.display.float_format = '{:.4f}'.format
np.set_printoptions(suppress=True)
warnings.filterwarnings('ignore')
pd.options.display.max_columns = None

In [2]:
import os
os.getcwd()

'C:\\Users\\ICICI\\Desktop\\New folder\\Project\\KPMG_AU_Data_Analytics_virtual_internship'

In [3]:
df_Transactions = pd.read_excel("kpmg_data.xlsx", sheet_name = "Transactions")

In [4]:
df_Transactions.head()

,transaction_id,product_id,customer_id,transaction_date,online_order,order_status,brand,product_line,product_class,product_size,list_price,standard_cost,product_first_sold_date
0,1,2,2950,2017-02-25,0.0000,Approved,Solex,Standard,medium,medium,71.4900,53.6200,41245.0000
1,2,3,3120,2017-05-21,1.0000,Approved,Trek Bicycles,Standard,medium,large,2091.4700,388.9200,41701.0000
2,3,37,402,2017-10-16,0.0000,Approved,OHM Cycles,Standard,low,medium,1793.4300,248.8200,36361.0000
3,4,88,3135,2017-08-31,0.0000,Approved,Norco Bicycles,Standard,medium,medium,1198.4600,381.1000,36145.0000
4,5,78,787,2017-10-01,1.0000,Approved,Giant Bicycles,Standard,medium,large,1765.3000,709.4800,42226.0000

In [5]:
df_CustomerDemographic = pd.read_excel("kpmg_data.xlsx", sheet_name= "CustomerDemographic")

In [6]:
df_CustomerDemographic.head(5)

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,default,owns_car,tenure
0,1,Laraine,Medendorp,Female,93,1953-10-12,Executive Secretary,Health,Mass Customer,N,"""'",Yes,11.0000
1,2,Eli,Bockman,Male,81,1980-12-16,Administrative Officer,Financial Services,Mass Customer,N,<script>alert('hi')</script>,Yes,16.0000
2,3,Arlin,Dearle,Male,61,1954-01-20,Recruiting Manager,Property,Mass Customer,N,2018-02-01 00:00:00,Yes,15.0000
3,4,Talbot,NaN,Male,33,1961-10-03,NaN,IT,Mass Customer,N,() { _; } >_[$($())] { touch /tmp/blns.shellsh...,No,7.0000
4,5,Sheila-kathryn,Calton,Female,56,1977-05-13,Senior Editor,NaN,Affluent Customer,N,NIL,Yes,8.0000

In [7]:
df_CustomerAddress = pd.read_excel("kpmg_data.xlsx", sheet_name = "CustomerAddress")

In [8]:
df_CustomerAddress.head(5)

,customer_id,address,postcode,state,country,property_valuation
0,1,060 Morning Avenue,2016,New South Wales,Australia,10
1,2,6 Meadow Vale Court,2153,New South Wales,Australia,10
2,4,0 Holy Cross Court,4211,QLD,Australia,9
3,5,17979 Del Mar Point,2448,New South Wales,Australia,4
4,6,9 Oakridge Court,3216,VIC,Australia,9

In [9]:
df_Transactions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20000 entries, 0 to 19999
Data columns (total 13 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   transaction_id           20000 non-null  int64
 1   product_id               20000 non-null  int64
 2   customer_id              20000 non-null  int64
 3   transaction_date         20000 non-null  datetime64[ns]
 4   online_order             19640 non-null  float64
 5   order_status             20000 non-null  object
 6   brand                    19803 non-null  object
 7   product_line             19803 non-null  object
 8   product_class            19803 non-null  object
 9   product_size             19803 non-null  object
 10  list_price               20000 non-null  float64
 11  standard_cost            19803 non-null  float64
 12  product_first_sold_date  19803 non-null  float64
dtypes: datetime64[ns](1), float64(4), int64(3), object(5)
memory usage: 2.0+ MB

In [10]:
#Missing Values
df_Transactions.isna().mean()*100

transaction_id            0.0000
product_id                0.0000
customer_id               0.0000
transaction_date          0.0000
online_order              1.8000
order_status              0.0000
brand                     0.9850
product_line              0.9850
product_class             0.9850
product_size              0.9850
list_price                0.0000
standard_cost             0.9850
product_first_sold_date   0.9850
dtype: float64

In [11]:
#Missing values is less than 2% of all records so we can drop them

df_Transactions.dropna(inplace=True)

In [12]:
df_Transactions.shape

(19445, 13)

In [13]:
df_Transactions.isna().mean()*100

transaction_id            0.0000
product_id                0.0000
customer_id               0.0000
transaction_date          0.0000
online_order              0.0000
order_status              0.0000
brand                     0.0000
product_line              0.0000
product_class             0.0000
product_size              0.0000
list_price                0.0000
standard_cost             0.0000
product_first_sold_date   0.0000
dtype: float64

In [14]:
df_Transactions["order_status"].value_counts()

Approved     19273
Cancelled      172
Name: order_status, dtype: int64

In [15]:
df_Transactions["brand"].value_counts()

Solex             4169
WeareA2B          3245
Giant Bicycles    3244
OHM Cycles        2993
Trek Bicycles     2931
Norco Bicycles    2863
Name: brand, dtype: int64

In [16]:
df_Transactions["product_line"].value_counts()

Standard    13920
Road         3894
Touring      1213
Mountain      418
Name: product_line, dtype: int64